ZigEmbeddedGroup/microzig/port/wch/ch32h/src/chips/ch32h417.svd
				<register>
					<name>LINK_CFG</name>
					<description>LINK Configuration Register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<resetValue>0xC0000128</resetValue>
					<fields>
						<field>
							<name>LINK_RESET</name>
							<description>LINK reset, including the reset state machine and all interrupt flags, is highly effective</description>
							<bitRange>[31:31]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_TOUT_MODE</name>
							<description>SPEC configure</description>
							<bitRange>[21:21]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_U1_PING_EN</name>
							<description>Send PING_FPFS under U1 to enable</description>
							<bitRange>[20:20]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_U2_ALLOW</name>
							<description>High validity, after receiving the LGO_U2, the response LXU allows to enter the U2 state,
							otherwise after receiving the LGO_U2, the response LXU refuses to enter the U2 state.</description>
							<bitRange>[17:17]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>LINK_U1_ALLOW</name>
							<description>High validity, after receiving the LGO_U1, the response LAU allows to enter the U1 state, 
							otherwise, after receiving the LGO_U1, the response LXU refuses to enter the U1 state</description>
							<bitRange>[16:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_LTSSM_MODE</name>
							<description>The link state machine enters DISABLE mode</description>
							<bitRange>[15:15]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_LOOKBACK_ACT</name>
							<description>It is used in LOOPBACK mode for the LOOPBACK master to control the pattern transmission (the LOOPBACK slave keeps 0),
							and the ACT is a high-level signal that lasts for a period of time.</description>
							<bitRange>[14:14]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_LOOPBACK_EN</name>
							<description>The LOOPBACK enable bit is allowed, which is highly active, and can be used with the LOOKBACK enable in TX/RX_TS_CFG [3], 
							both of which are valid before LINK can enter the LOOKBACK mode 
							(used to enable the data loopback and error counting of the LOOPBACK slave, 
							and the LOOPBACK master remains 0). </description>
							<bitRange>[13:13]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>LINK_U2_DET_EN</name>
							<description>Detection mode of connected devices in U2 state</description>
							<bitRange>[12:12]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_CP78_SEL</name>
							<description>In Compliance Pattern 7/8, send a length of consecutive 0 or consecutive 1</description>
							<bitRange>[11:10]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_TX_DEEMPH</name>
							<description>Transmitter de-emphasis control</description>
							<bitRange>[9:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_TX_SWING</name>
							<description>The transmitter signal swing control, low swing power consumption, but affect the transmission distance</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>LINK_RX_EQ_EN</name>
							<description>Receiver equalization enable control, optional protocol specifications</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_LFPS_RX_PD</name>
							<description>LFPS receive control, this bit is 1 to disable LFPS reception</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_COMPLIANCE_EN</name>
							<description>POLLING_LFPS timeout is in COMPLIANCE mode</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_PHY_RESET</name>
							<description>The PIPE interface is reset</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>LINK_SS_PLR_SWAP</name>
							<description>Exchange SSTX and SSRX polarities as follows</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_RX_TERM_EN</name>
							<description>Receiver Termination Resistance Control</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_DOWN_MODE</name>
							<description>Peripheral Type</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>	
					</fields>
				</register>

				<register>
					<name>LINK_CTRL</name>
					<description>LINK control registers</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000013</resetValue>
					<fields>
						<field>
							<name>LINK_RX_TS_CFG</name>
							<description>Received Link Control</description>
							<bitRange>[31:24]</bitRange>
							<access>read-only</access>
						</field>					
						<field>
							<name>LINK_TX_TS_CFG</name>
							<description>Send the link configuration of the TS1/TS2 training sequence</description>
							<bitRange>[23:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_TX_LGO_U3</name>
							<description>After the bit is valid, the LGO_U3 is transmitted, and the hardware is automatically cleared</description>
							<bitRange>[15:15]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_TX_LGO_U2</name>
							<description>After the bit is valid, the LGO_U2 is sent, the high is active, and the hardware is automatically cleared</description>
							<bitRange>[14:14]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_TX_LGO_U1</name>
							<description>After the bit is valid, the LGO_U1 is sent, the high is active, and the hardware is automatically cleared</description>
							<bitRange>[13:13]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_POLLING_EN</name>
							<description>If the TERM is detected by the SS.RX_DETECT, 
							a POLLING handshake will be performed after the software sets the bit to be valid</description>
							<bitRange>[12:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_REG_ROUT_EN</name>
							<description>Enable the routing function of the HUB, which is highly effective, with registers and no interfaces</description>
							<bitRange>[11:11]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_LUP_LDN_EN</name>
							<description>In the U0 state, if there is no data, whether to send LUP and LDN packets every 10us</description>
							<bitRange>[10:10]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>LINK_TX_UX_EXIT</name>
							<description>High validity, hardware automatic zeroing</description>
							<bitRange>[9:9]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_TX_WARM_RST</name>
							<description>High validity, cleared by software. A valid bit will send a warm-reset</description>
							<bitRange>[8:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_GO_RX_DET</name>
							<description>Before setting this bit, the PD_MODE should be set to P2 mode, 
							and the LINK should be set to enter the SS.RX_DETECT, 
							and the software will query TERM_PRESENT to know whether there is a connection or whether the connection is disconnected. 
							High effectiveness, automatic clearing.</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_GO_RECOVERY</name>
							<description>SET THE LINK TO ENTER SS.RECOVERY, 
							WHICH IS HIGHLY EFFECTIVE, AND THE HARDWARE IS AUTOMATICALLY CLEARED.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>LINK_GO_INACTIVE</name>
							<description>SET THE LINK TO ENTER SS.INACTIVE, 
							WHICH IS HIGHLY VALID, AND THE HARDWARE IS AUTOMATICALLY CLEARED</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_GO_DISABLED</name>
							<description>SET LINK TO ENTER SS.DISABLED, WHICH IS HIGHLY VALID, 
							AND REQUIRES SOFTWARE TO CLEAR</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_PD_MODE</name>
							<description>Configure the current power mode of the PHY, corresponding to PO/P1/P2/P3 in the PIPE</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>						
					</fields>
				</register>
				<register>
					<name>LINK_INT_CTRL</name>
					<description>LINK interrupt enable register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_IE_STATE_CHG</name>
							<description>Link State Machine Change Flag Interrupt Enabled</description>
							<bitRange>[31:31]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IE_U1_TOUT</name>
							<description>U1 Timeout Interrupt Enabled</description>
							<bitRange>[30:30]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_U2_TOUT</name>
							<description>U2 Timeout Interrupt Enabled</description>
							<bitRange>[29:29]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_UX_FAIL</name>
							<description>UX Conversion Failure Interrupt Enabled</description>
							<bitRange>[28:28]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>LINK_IE_TX_WARMRST</name>
							<description>Send warm_reset end interrupt enabled</description>
							<bitRange>[27:27]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IE_UX_EXIT_FAIL</name>
							<description>Exit UX failed to interrupt enabled</description>
							<bitRange>[26:26]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_RX_LMP_TOUT</name>
							<description>Receive LMP Timeout Interrupt Enabled</description>
							<bitRange>[23:23]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_TX_LMP</name>
							<description>If you successfully enter U0, you can send an HP packet to interrupt enable</description>
							<bitRange>[22:22]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_RX_LMP</name>
							<description>Received Link Command Flag Interrupt Enabled</description>
							<bitRange>[21:21]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IE_RX_DET</name>
							<description>The link enters the Rx.Detect state and is interrupted</description>
							<bitRange>[20:20]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_LOOPBACK</name>
							<description>The link goes into loopback mode for testing and error isolation interrupt enablement</description>
							<bitRange>[19:19]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_COMPLIANCE</name>
							<description>The link enters the compliance test, 
							and the interrupt is enabled by the compatibility test or the physical layer conformance test</description>
							<bitRange>[18:18]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_HPBUF_FULL</name>
							<description>BUF sends FIFO full interrupt enable</description>
							<bitRange>[17:17]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IE_HPBUF_EMPTY</name>
							<description>BUF sends FIFO null interrupt enable</description>
							<bitRange>[16:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_HOT_RST</name>
							<description>hot reset, which uses the reset interrupt enable of the TS1/TS2 ordered set</description>
							<bitRange>[15:15]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_U3_WAKEUP</name>
							<description>In the U3 state, the Low Frequency Periodic Signal (LFPS) is received to wake up interrupt enabled</description>
							<bitRange>[14:14]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_WARM_RST</name>
							<description>Warm reset (not connected) interrupt enabled with LPFS</description>
							<bitRange>[13:13]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IE_UX_EXIT</name>
							<description>Request to exit UX is received Interrupt Enable</description>
							<bitRange>[12:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_TXEQ</name>
							<description>LINK enters the POLLING_RXEQ for receiver equalization training interrupt enable</description>
							<bitRange>[11:11]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_TERM_PRES</name>
							<description>LINK enters the RX_DETECT to detect the impedance of the remote receiver trace segment and detect the interrupt enabled</description>
							<bitRange>[10:10]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>LINK_IE_UX_REJ</name>
							<description>Transmit LGO_ Ux, receive LXU interrupt enabled that refuses to enter the Ux</description>
							<bitRange>[9:9]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IE_U3_WK_TOUT</name>
							<description>Interrupt the U3 command when requesting to exit U3 command timeout</description>
							<bitRange>[8:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_GO_U0</name>
							<description>LINK is interrupted at U0 to enable the following</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_GO_U1</name>
							<description>LINK is interrupted at U1 to enable the following</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_GO_U2</name>
							<description>LINK is interrupted at U2 and enabled</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IE_GO_U3</name>
							<description>LINK is enabled when the U3 interrupt is enabled</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_DISABLE</name>
							<description>LINK is disabled, interrupt enabled</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_INACTIVE</name>
							<description>LINK is enabled on INACTIVE interrupt</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_RECOVERY</name>
							<description>DUE TO ERROR LINK IN RECOVERY INTERRUPTED ENABLED</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_READY</name>
							<description>LINK is initialized, including two ports before (Header Sequence Number Advertisement) 
							and (RX Headr Buffer Credit Advertisement) interrupt enabled</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>	
					</fields>
				</register>
				<register>
					<name>LINK_INT_FLAG</name>
					<description>LINK Interrupt Flag Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_IF_STATE_CHG</name>
							<description>link_reset reset to 0</description>
							<bitRange>[31:31]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IF_U1_TOUT</name>
							<description>U1 timeout interrupted</description>
							<bitRange>[30:30]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_U2_TOUT</name>
							<description>U2 timeout interrupted</description>
							<bitRange>[29:29]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_UX_FAIL</name>
							<description>Enter the Ux failed to interrupt</description>
							<bitRange>[28:28]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_TX_WARMRST</name>
							<description>send warm_reset to end interrupt</description>
							<bitRange>[27:27]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IF_UX_EXIT_FAIL</name>
							<description>Exit UX fails to interrupt</description>
							<bitRange>[26:26]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_RX_LMP_TOUT</name>
							<description>After the LINK initialization is complete, 
							the Port Capabilities/Configuration LMPs timeout (20us) interrupt flag is exchanged.</description>
							<bitRange>[23:23]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_TX_LMP</name>
							<description>After the LINK initialization is completed, 
							the software is configured to send Port Capabilities LMP for port capability switching</description>
							<bitRange>[22:22]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_RX_LMP</name>
							<description>Receive LMP Interrupt Flag</description>
							<bitRange>[21:21]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IF_RX_DET</name>
							<description>After entering the RX_DETECT state interrupt flag, this position 1,
							the software sets the PWR_MODE to P2, ready for RX_DETECT</description>
							<bitRange>[20:20]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_LOOPBACK</name>
							<description>LINK enters the LOOPBACK state and the LINK is interrupted.</description>
							<bitRange>[19:19]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_COMPLIANCE</name>
							<description>LINK enters the COMPLIANCE state with an outage flag.</description>
							<bitRange>[18:18]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_HPBUF_FULL</name>
							<description>Header Packet buffer full interrupt flag.</description>
							<bitRange>[17:17]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IF_HPBUF_EMPTY</name>
							<description>he device receives the HOT RESET interrupt flag</description>
							<bitRange>[16:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_HOT_RST</name>
							<description>The device receives the HOT RESET interrupt flag</description>
							<bitRange>[15:15]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_WAKEUP</name>
							<description>The power supply is in P3 mode and the LFPS signal interrupt flag is detected.</description>
							<bitRange>[14:14]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_WARM_RST</name>
							<description>The WARM RESET status change (active-&gt; inactive, 
							or invalid-&gt;active) interrupt flag received by the device. </description>
							<bitRange>[13:13]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IF_UX_EXIT</name>
							<description>LINK receives the LFPS ready to exit U1/U2/U3 request interrupt flag</description>
							<bitRange>[12:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_TXEQ</name>
							<description>LINK enters TXEQ state interrupt flag:
								INDICATE THAT THE POLLING HANDSHAKE IS COMPLETE, 
								AND WAIT FOR THE SOFTWARE TO SET THE PWR_MODE TO P0 IN ORDER TO ENTER THE TXEQ PHASE.</description>
							<bitRange>[11:11]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_TERM_PRES</name>
							<description>The TERM disconnected or disconnected flag was detected</description>
							<bitRange>[10:10]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>LINK_IF_UX_REJ</name>
							<description>LINK refuses to enter the low-power mode (U1/U2) interrupt flag. </description>
							<bitRange>[9:9]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IF_U3_WK_TOUT</name>
							<description>Wake up from U3 to timeout interrupt flag (10ms). </description>
							<bitRange>[8:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_GO_U0</name>
							<description>LINK enters the U0 state interrupt flag.</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_GO_U1</name>
							<description>LINK enters the U1 state interrupt flag.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>LINK_IF_GO_U2</name>
							<description>LINK enters the U2 state interrupt flag.</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LINK_IF_GO_U3</name>
							<description>LINK enters the U3 state interrupt flag.</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_DISABLE</name>
							<description>LINK INTO SS.DISABLE STATE INTERRUPT FLAG</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_INACTIVE</name>
							<description>LINK ENTERS THE SS.ACTIVE STATE INTERRUPT FLAG</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>LINK_IF_RECOVERY</name>
							<description>LINK INTO THE SS.RECOVERY STATE INTERRUPT FLAG</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IF_READY</name>
							<description>LINK enters the U0 state and completes LINK initialization of the interrupt flag.</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
