ZigEmbeddedGroup/microzig/port/wch/ch32h/src/chips/ch32h417.svd
				<register>
					<name>LINK_STATUS</name>
					<description>LINK Status Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_HPBUF_EMPTY</name>
							<description>The HP buffer is empty.</description>
							<bitRange>[31:31]</bitRange>
							<access>read-only</access>
						</field>					
						<field>
							<name>LINK_HPBUF_FULL</name>
							<description>The HP buffer is full.</description>
							<bitRange>[30:30]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_HPBUF_IDLE</name>
							<description>BUF sends the status of the FIFO IDLE</description>
							<bitRange>[29:29]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_U3_SLEEP_ALLOW</name>
							<description>The link is in the U3 state and sleep is allowed</description>
							<bitRange>[22:22]</bitRange>
							<access>read-only</access>
						</field>	
						<field>
							<name>LINK_U2_SLEEP_ALLOW</name>
							<description>The link is in the U2 state and sleep is allowed. </description>
							<bitRange>[21:21]</bitRange>
							<access>read-only</access>
						</field>					
						<field>
							<name>LINK_RXDET_SLEEP_ALLOW</name>
							<description>The link is in the RXDET state, allowing sleep. </description>
							<bitRange>[20:20]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_WAKUP</name>
							<description>A link wake-up signal is received.</description>
							<bitRange>[19:19]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_RX_LFPS</name>
							<description>The link receives an LFPS signal.</description>
							<bitRange>[18:18]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_RX_DETECT</name>
							<description>The link is at P2 and is in rx_detect. </description>
							<bitRange>[17:17]</bitRange>
							<access>read-only</access>
						</field>					
						<field>
							<name>LINK_RX_UX_EXIT_REQ</name>
							<description>Received a request to exit Ux</description>
							<bitRange>[16:16]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_STATE</name>
							<description>Link Status</description>
							<bitRange>[11:8]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_TXEQ</name>
							<description>The link is in POLLING_RXEQ.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_PD_MODE_MASK</name>
							<description>Link Power Status</description>
							<bitRange>[5:4]</bitRange>
							<access>read-only</access>
						</field>					
						<field>
							<name>LINK_READY</name>
							<description>When the LINK enters the U0 state, the position 1 exits the U0 state after the initialization
							(broadcast) is completed, and the bit is automatically cleared.</description>
							<bitRange>[3:3]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_BUSY</name>
							<description>When the LINK is busy, the bit is 1 when the switchover is PD_MODE,
							and the hardware will automatically clear the link after the switchover is completed. </description>
							<bitRange>[2:2]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_RX_WARM_RST</name>
							<description>A valid warm-reset signal is received from the host 
							(the hardware automatically pulls up after receiving the host's warm_reset 18ms).</description>
							<bitRange>[1:1]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_RX_TERM_PRES</name>
							<description>After RX_DETECT, if a receive termination resistor is present, the bit is 1</description>
							<bitRange>[0:0]</bitRange>
							<access>read-only</access>
						</field>						
					</fields>
				</register>
				<register>
					<name>LINK_ITP_PRE</name>
					<description>LINK ITP Timeout Mode Register</description>
					<addressOffset>0x17</addressOffset>
					<size>0x8</size>
					<resetValue>0x80</resetValue>
					<fields>
						<field>
							<name>ITP_PRE</name>
							<description>ITP Timeout Mode</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>											
					</fields>
				</register>	
				<register>
					<name>LINK_U2_INACT_TIMER</name>
					<description>LINK U2 Inactivity Timeout Counter Threshold Register</description>
					<addressOffset>0x1D</addressOffset>
					<size>0x8</size>
					<resetValue>0X00</resetValue>
					<fields>
						<field>
							<name>U2_INACTIVE_TIMER</name>
							<description>The value of the inactivity timeout counter threshold for U2</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>	
				<register>
					<name>LINK_U1_WKUP_FILTER</name>
					<description>U1 wakes up the LFPS Duration Register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x8</size>
					<resetValue>0x4A</resetValue>
					<fields>
						<field>
							<name>U1_WKUP_FILTER</name>
							<description>The duration of the LFPS received by U1 when exiting. 
							When the receiving LFPS reaches this time, the received U1 EXIT is considered valid, 
							and the handshake is successful when the transmitting LFPS_last is raised, which is 600ns by default
							U1_WKUP_FILTER [7]: the unit of time that controls the U1_WKUP_FILTER [6:0]</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>	
				<register>
					<name>LINK_U2_WKUP_FILTER</name>
					<description>U2 wakes up the LFPS Duration Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x8</size>
					<resetValue>0X02</resetValue>
					<fields>
						<field>
							<name>U2_WKUP_FILTER</name>
							<description>When the receiving LFPS reaches this time, the sending LFPS_last is pulled up and the handshake is successful, 
							and the received U2 EXIT can be considered valid with the duration of (n)us, the default is 2us. </description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>	
				<register>
					<name>LINK_U3_WKUP_FILTER</name>
					<description>U3 wakes up the LFPS validity duration register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x8</size>
					<resetValue>0X64</resetValue>
					<fields>
						<field>
							<name>U3_WKUP_FILTER</name>
							<description>When the receiving LFPS reaches this time, the LFPS_last is raised, and the handshake is successful, 
							and the received U3 EXIT is considered valid for (n)us, with a default of 100us. </description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>	
				<register>
					<name>LINK_ISO_DLY</name>
					<description>LINK Synchronous Delay Register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x10</size>
					<resetValue>0x0028</resetValue>
					<fields>
						<field>
							<name>LINK_ISOCH_DLY</name>
							<description>The delay time for the serial bitstream to parse to the parallel data is 40ns by default, 
							and the SET ISOCH DELAY host sends this information to the device when enumerated, 
							and writes the delay information to the register as the device, and the lower 3 bits of the register are invalid 
							(because the clock frequency is 125MHz, the delay time needs to be set to 8*n).</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>	
				<register>
					<name>LINK_LPM_CR</name>
					<description>Link Power Management Registers</description>
					<addressOffset>0x50</addressOffset>
					<size>0x10</size>
					<resetValue>0x0180</resetValue>
					<fields>
						<field>
							<name>PHY_CHSEL_AUTO</name>
							<description>Automatic selection of the PHY layer transceiver channel type</description>
							<bitRange>[13:13]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LPM_RXDET_EN</name>
							<description>When the lpm count reaches the expected value RXDET_EXP it is confirmed that
							a device is connected to the PHY, this bit is raised.</description>
							<bitRange>[12:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LPM_TERM_PRESENT</name>
							<description>The PHY layer detects a device connection. </description>
							<bitRange>[11:11]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>LPM_TERM_CHG</name>
							<description>The connected device changes, plugs in the device or unplugs the device. </description>
							<bitRange>[10:10]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LPM_EN</name>
							<description>LPM Enable</description>
							<bitRange>[9:9]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LPM_RST</name>
							<description>Reset signal for LPM related register</description>
							<bitRange>[8:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RXDET_EXP</name>
							<description>Detects external device counter registers. </description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>						
					</fields>
				</register>
				<register>
					<name>LINK_LMP_PORT_CAP</name>
					<description>PORT_CAP Registers</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_LMP_RX_CAP_VLD</name>
							<description>A valid PORT_CAP-LMP is received, and the protocol stipulates that 
							the two LINK parties exchange PORT_CAP-LMP within 20 years after entering the U0 state.</description>
							<bitRange>[31:31]</bitRange>
							<access>read-only</access>
						</field>					
						<field>
							<name>LINK_LMP_TX_CAP_VLD</name>
							<description>PORT Capability configuration completion flag </description>
							<bitRange>[30:30]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_SPEED</name>
							<description>[24] Position 1, indicating that the supported device supports USB3.2 Gen1 (5Gbps). </description>
							<bitRange>[29:24]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_REG_PORT_CAP</name>
							<description>link port configure</description>
							<bitRange>[23:0]</bitRange>
							<access>read-only</access>
						</field>						
					</fields>
				</register>
				<register>
					<name>LINK_LMP_RX_DATA0</name>
					<description>LMP receives data 0 register</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_LMP_RX_DATA0</name>
							<description>Once the LMP is received, the HP data is stored in this register [31:0]</description>
							<bitRange>[31:0]</bitRange>
							<access>read-only</access>
						</field>											
					</fields>
				</register>		
				<register>
					<name>LINK_LMP_RX_DATA1</name>
					<description>LMP receives data 1 register</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_LMP_RX_DATA1</name>
							<description>Once the LMP is received, the HP data is stored in this register [63:32]</description>
							<bitRange>[31:0]</bitRange>
							<access>read-only</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>LINK_LMP_RX_DATA2</name>
					<description>LMP receives data 2 register</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_LMP_RX_DATA1</name>
							<description>Once the LMP is received, the HP data is stored in this register [95:64]</description>
							<bitRange>[31:0]</bitRange>
							<access>read-only</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>LINK_LMP_TX_DATA0</name>
					<description>USB Custom HP Data 0 Register</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_LMP_TX_DATA0</name>
							<description>The data of the user-defined HP is sent [31:0]</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>LINK_LMP_TX_DATA1</name>
					<description>USB Custom HP Data 1 Register</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_LMP_TX_DATA1</name>
							<description>The data of the user-defined HP is sent [63:32]</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>LINK_LMP_TX_DATA2</name>
					<description>USB Custom HP Data 2 Register</description>
					<addressOffset>0x6c</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_LMP_TX_DATA2</name>
							<description>The data of the user-defined HP is sent [95:64]</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>
