ZigEmbeddedGroup/microzig/port/wch/ch32h/src/chips/ch32h417.svd
      </registers>
    </peripheral>

	<peripheral>
		<name>EMMC</name>
		<description>EMMC register</description>
		<groupName>EMMC</groupName>
		<baseAddress>0x40024000</baseAddress>
		<addressBlock>
			<offset>0x00</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>	
      <interrupt>
        <name>SDMMC</name>
        <description>SDMMC global interrupt</description>
        <value>95</value>
      </interrupt>		
 		<registers>

			<register>
				<name>EMMC_ARGUMENT</name>
				<description>SD 32bits command argument register</description>
				<addressOffset>0x00</addressOffset>
				<size>32</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
				    <field>
						<name>EMMC_ARGUMENT</name>
						<description>32 bit command parameter register</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>	
			</register>
			<register>
				<name>EMMC_CMD_SET</name>
				<description>SD 16bits cmd setting register</description>
				<addressOffset>0x04</addressOffset>
				<size>16</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>EMMC_CMDIDX_MASK</name>
						<description>the index number of the currently sent command</description>
						<bitRange>[5:0]</bitRange>
					</field>
					<field>
						<name>EMMC_RPTY_MASK</name>
						<description>current respone type</description>
						<bitRange>[9:8]</bitRange>
					</field>
					<field>
						<name>EMMC_CKCRC</name>
						<description>check the response CRC</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>EMMC_CKIDX</name>
						<description>check the response command index</description>
						<bitRange>[11:11]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>EMMC_RESPONSE0</name>
				<description>SD 128bits response register, [31:0] 32bits </description>
				<addressOffset>0x08</addressOffset>
				<size>32</size>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
                <fields>
				    <field>
						<name>EMMC_RESPONSE0</name>
						<description>response parameter register</description>
						<bitRange>[31:0]</bitRange>
					</field>
                </fields>
			</register>
			<register>
				<name>EMMC_RESPONSE1</name>
				<description>SD 128bits response register, [63:32] 32bits </description>
				<addressOffset>0x0C</addressOffset>
				<size>32</size>
				<access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
					<field>
						<name>EMMC_RESPONSE1</name>
						<description>response parameter register</description>
						<bitRange>[31:0]</bitRange>
					</field>
                </fields>
			</register>
			<register>
				<name>EMMC_RESPONSE2</name>
				<description>SD 128bits response register, [95:64] 32bits </description>
				<addressOffset>0x10</addressOffset>
				<size>32</size>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
                <fields>
					<field>
						<name>EMMC_RESPONSE2</name>
						<description>response parameter register</description>
						<bitRange>[31:0]</bitRange>
					</field>
                </fields>
			</register>
            <register>
				<name>EMMC_RESPONSE3</name>
				<description>SD 128bits response register, [127:96] 32bits </description>
				<addressOffset>0x14</addressOffset>
				<size>32</size>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
                <fields>
					<field>
						<name>EMMC_RESPONSE3</name>
						<description>response parameter register</description>
						<bitRange>[31:0]</bitRange>
					</field>
                </fields>
			</register>
			<register>
				<name>EMMC_WRITE_CONT</name>
				<description>Multiplexing register of the EMMC_RESPONSE3,[127:96] 32bits</description>
				<alternateRegister>EMMC_RESPONSE3</alternateRegister>
				<addressOffset>0x14</addressOffset>
				<size>32</size>
				<access>write-only</access>
				<resetValue>0x00000000</resetValue>
                <fields>
					<field>
						<name>EMMC_WRITE_CONT</name>
						<description>response parameter register</description>
						<bitRange>[31:0]</bitRange>
					</field>
                </fields>
			</register>
 			<register>
				<name>EMMC_CONTROL</name>
				<description>SD 8 bits control register</description>
				<addressOffset>0x18</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x15</resetValue>
				<fields>
					<field>
						<name>EMMC_LW_MASK</name>
						<description>effctive data width for sending or receiving data </description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>EMMC_ALL_CLR</name>
						<description>reset all the inner logic, default is valid</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>EMMC_DMAEN</name>
						<description>enable the dma</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>EMMC_RST_LGC</name>
						<description>reset the data tran/recv logic</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>EMMC_NEGSMP</name>
						<description>controller use nagedge sample cmd</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>SLV_MODE</name>
						<description>enable Slave mode</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>SLV_FORCE_ERR</name>
						<description>Software forced data block CRC error in slave mode</description>
						<bitRange>[9:9]</bitRange>
					</field>
				</fields>
			</register>
 			<register>
				<name>EMMC_TIMEOUT</name>
				<description>SD 8 bits data timeout value</description>
				<addressOffset>0x1C</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<resetValue>0x0C</resetValue>
				<fields>
					<field>
						<name>EMMC_TOCNT_MASK</name>
						<description>response data timeout configuration  </description>
						<bitRange>[3:0]</bitRange>
					</field>
				</fields>
			</register>
            <register>
				<name>EMMC_STATUS</name>
				<description>SD status</description>
				<addressOffset>0x20</addressOffset>
				<size>32</size>
				<access>read-only</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>MASK_BLOCK_NUM</name>
						<description>the number of blocks successfully transmitted in the current multi-block transmission </description>
						<bitRange>[15:0]</bitRange>
					</field>
					<field>
						<name>EMMC_CMDSTA</name>
						<description>indicate cmd line is high level now </description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>EMMC_DAT0STA</name>
						<description>indicate dat[0] line is high level now</description>
						<bitRange>[17:17]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>EMMC_INT_FG</name>
				<description>SD 16bits interrupt flag register</description>
				<addressOffset>0x24</addressOffset>
				<size>16</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>EMMC_IF_RE_TMOUT</name>
						<description>indicate when expect the response, timeout </description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>EMMC_IF_RECRC_WR</name>
						<description>indicate CRC error of the response </description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>EMMC_IF_REIDX_ER</name>
						<description>indicate INDEX error of the response </description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>EMMC_IF_CMDDONE</name>
						<description>when cmd hasn't response, indicate cmd has been sent, when cmd has a response, indicate cmd has bee sent and has received the response</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>EMMC_IF_DATTMO</name>
						<description>data line busy timeout </description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>EMMC_IF_TRANERR</name>
						<description>last block have encountered a CRC error </description>
						<bitRange>[5:5]</bitRange>
					</field>
                    <field>
						<name>EMMC_IF_TRANDONE</name>
						<description>all the blocks have been tran/recv successfully </description>
						<bitRange>[6:6]</bitRange>
					</field>
                    <field>
						<name>EMMC_IF_BKGAP</name>
						<description>every block gap interrupt when multiple read/write, allow drive change the DMA address at this moment  </description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>EMMC_IF_FIFO_OV</name>
						<description>fifo overflow, when write sd, indicate empty overflow, when read sd, indicate full overflow</description>
						<bitRange>[8:8]</bitRange>
					</field>
					 <field>
						<name>EMMC_IF_SDIOINT</name>
						<description>interrupt from SDIO card inside </description>
						<bitRange>[9:9]</bitRange>
					</field>
					 <field>
						<name>SIF_SLV_BUF_RELEASE</name>
						<description>In slave double buffer mode,BUF releases the flag bit</description>
						<bitRange>[10:10]</bitRange>
					</field>
				</fields>				
			</register>
			<register>
				<name>EMMC_INT_EN</name>
				<description>SD 16bits interrupt enable register</description>
				<addressOffset>0x28</addressOffset>
				<size>16</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>EMMC_IE_RE_TMOUT</name>
						<description>command response timeout interrupt enable</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>EMMC_IE_RECRC_WR</name>
						<description>response CRC check error interrupt  enable </description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>EMMC_IE_REIDX_ER</name>
						<description>response index check error interrupt  enable</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>EMMC_IE_CMDDONE</name>
						<description>command completion interrupt enable</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>EMMC_IE_DATTMO</name>
						<description>data timeout interrupt enable</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>EMMC_IE_TRANERR</name>
						<description>blocks transfer CRC error interrupt enable</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>EMMC_IE_TRANDONE</name>
						<description>all blocks transfer complete interrupt enable</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>EMMC_IE_BKGAP</name>
						<description>single block transmission completion interrupt enable</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>EMMC_IE_FIFO_OV</name>
						<description>FIFO overflow interrupt enable</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>EMMC_IE_SDIOINT</name>
						<description>SDIO card interrupt enable</description>
						<bitRange>[9:9]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>EMMC_DMA_BEG1</name>
				<description>SD 32 bits DMA start address register when to operate</description>
				<addressOffset>0x2C</addressOffset>
				<size>32</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>EMMC_DMAAD1_MASK</name>
						<description>start address of read-write data buffer,the lower 4 bits are fixed to 0</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>EMMC_BLOCK_CFG</name>
				<description>SD 32bits data counter, [15:0] number of blocks this time will tran/recv, [27:16] block sise(byte number) of every block in this time tran/recv</description>
				<addressOffset>0x30</addressOffset>
				<size>32</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>EMMC_BKNUM_MASK</name>
						<description>the number of blocks to be transferred</description>
						<bitRange>[15:0]</bitRange>
					</field>
					<field>
						<name>EMMC_BKSIZE_MASK</name>
						<description>single block transfer size</description>
						<bitRange>[27:16]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>EMMC_TRAN_MODE</name>
				<description>SD TRANSFER MODE register</description>
				<addressOffset>0x34</addressOffset>
				<size>32</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>EMMC_DMA_DIR</name>
						<description>set DMA direction is controller to emmc card</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>EMMC_GAP_STOP</name>
						<description>clock stop mode after block completion</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>EMMC_MODE_BOOT</name>
						<description>enable emmc boot mode</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>EMMC_AUTOGAPSTOP</name>
						<description>enable auto set bTM_GAP_STOP when tran start</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>EMMC_DMATN_CNT</name>
						<description>in double buffer mode,set the block count value of buffer switch</description>
						<bitRange>[14:8]</bitRange>
					</field>
					<field>
						<name>EMMC_DULEDMA_EN</name>
						<description>enable double buffer dma</description>
						<bitRange>[16:16]</bitRange>
					</field>
					<field>
						<name>DDR_MODE</name>
						<description>enable DDR mode</description>
						<bitRange>[17:17]</bitRange>
					</field>					
					<field>
						<name>CARE_NEG</name>
						<description>In DDR mode,check the falling edge of the clock</description>
						<bitRange>[18:18]</bitRange>
					</field>					
					<field>
						<name>SW</name>
						<description>In DDR mode,the clock is switched</description>
						<bitRange>[20:19]</bitRange>
					</field>							
				</fields>
			</register>
			<register>
				<name>EMMC_CLK_DIV</name>
				<description>SD clock divider register</description>
				<addressOffset>0x38</addressOffset>
				<size>16</size>
				<access>read-write</access>
				<resetValue>0x0213</resetValue>
				<fields>
					<field>
						<name>EMMC_DIV_MASK</name>
						<description>clk div</description>
						<bitRange>[4:0]</bitRange>
					</field>
					<field>
						<name>EMMC_CLKOE</name>
						<description>chip output sdclk oe</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>EMMC_CLKMode</name>
						<description>EMMC clock frequency mode selection bit</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>EMMC_PHASEINV</name>
						<description>invert chip output sdclk phase</description>
						<bitRange>[10:10]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>EMMC_DMA_BEG2</name>
				<description>SD 32bits DMA start address register when to operate</description>
				<addressOffset>0x3C</addressOffset>
				<size>32</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>EMMC_DMAAD2_MASK</name>
						<description>start address of read-write data buffer,the lower 4 bits are fixed to 0</description>
						<bitRange>[31:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>EMMC_TUNE_DATO</name>
				<description>data output delay register</description>
				<addressOffset>0x40</addressOffset>
				<size>32</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>TUNNE_DAT0_O</name>
						<description>the delay of data 0 output</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>TUNNE_DAT1_O</name>
						<description>the delay of data 1 output</description>
						<bitRange>[7:4]</bitRange>
					</field>					
					<field>
						<name>TUNNE_DAT2_O</name>
						<description>the delay of data 2 output</description>
						<bitRange>[11:8]</bitRange>
					</field>					
					<field>
						<name>TUNNE_DAT3_O</name>
						<description>the delay of data 3 output</description>
						<bitRange>[15:12]</bitRange>
					</field>					
					<field>
						<name>TUNNE_DAT4_O</name>
						<description>the delay of data 4 output</description>
						<bitRange>[19:16]</bitRange>
					</field>
					<field>
						<name>TUNNE_DAT5_O</name>
						<description>the delay of data 5 output</description>
						<bitRange>[23:20]</bitRange>
					</field>
					<field>
						<name>TUNNE_DAT6_O</name>
						<description>the delay of data 6 output</description>
						<bitRange>[27:24]</bitRange>
					</field>
					<field>
						<name>TUNNE_DAT7_O</name>
						<description>the delay of data 7 output</description>
						<bitRange>[31:28]</bitRange>
					</field>					
				</fields>
			</register>			
			<register>
				<name>EMMC_TUNE_DATI</name>
				<description>data input delay register</description>
				<addressOffset>0x44</addressOffset>
				<size>32</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>TUNNE_DAT0_I</name>
						<description>In DDR mode,the delay of data 0 input</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>TUNNE_DAT1_I</name>
						<description>In DDR mode,the delay of data 1 input</description>
						<bitRange>[7:4]</bitRange>
					</field>					
					<field>
						<name>TUNNE_DAT2_I</name>
						<description>In DDR mode,the delay of data 2 input</description>
						<bitRange>[11:8]</bitRange>
					</field>					
					<field>
						<name>TUNNE_DAT3_I</name>
						<description>In DDR mode,the delay of data 3 input</description>
						<bitRange>[15:12]</bitRange>
					</field>					
					<field>
						<name>TUNNE_DAT4_I</name>
						<description>In DDR mode,the delay of data 4 input</description>
						<bitRange>[19:16]</bitRange>
					</field>
					<field>
						<name>TUNNE_DAT5_I</name>
						<description>In DDR mode,the delay of data 5 input</description>
						<bitRange>[23:20]</bitRange>
					</field>
					<field>
						<name>TUNNE_DAT6_I</name>
						<description>In DDR mode,the delay of data 6 input</description>
						<bitRange>[27:24]</bitRange>
					</field>
					<field>
						<name>TUNNE_DAT7_I</name>
						<description>In DDR mode,the delay of data 7 input</description>
						<bitRange>[31:28]</bitRange>
					</field>					
				</fields>
			</register>				
			<register>
				<name>EMMC_TUNE_CLK_CMD</name>
				<description>clock and command delay registers</description>
				<addressOffset>0x48</addressOffset>
				<size>32</size>
				<access>read-write</access>
				<resetValue>0x00000000</resetValue>
				<fields>
					<field>
						<name>TUNNE_CLK_O</name>
						<description>In DDR mode,delay in command input</description>
						<bitRange>[3:0]</bitRange>
					</field>			
					<field>
						<name>TUNNE_CLK_I</name>
						<description>In DDR mode,delay in command output</description>
						<bitRange>[7:4]</bitRange>
					</field>
					<field>
						<name>TUNNE_CMD_O</name>
						<description>In DDR mode,the delay of the clock input</description>
						<bitRange>[19:16]</bitRange>
					</field>
					<field>
						<name>TUNNE_CMD_I</name>
						<description>In DDR mode,the delay of the clock output</description>
						<bitRange>[23:20]</bitRange>
					</field>
				</fields>
			</register>				
