ZigEmbeddedGroup/microzig/port/wch/ch32h/src/chips/ch32h417.svd
		<register>
          <name>IPSR3</name>
          <displayName>IPSR3</displayName>
          <description>Interrupt Pending Register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDSET</name>
              <description>PENDSET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>		
		<register>
          <name>IPSR4</name>
          <displayName>IPSR4</displayName>
          <description>Interrupt Pending Register</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDSET</name>
              <description>PENDSET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>		
		<register>
          <name>IPSR5</name>
          <displayName>IPSR5</displayName>
          <description>Interrupt Pending Register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDSET</name>
              <description>PENDSET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>		
		<register>
          <name>IPRR1</name>
          <displayName>IPRR1</displayName>
          <description>Interrupt Pending Clear Register</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDRST2_3</name>
              <description>PENDRESET</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PENDRST5</name>
              <description>PENDRESET</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENDRST8</name>
              <description>PENDRESET</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PENDRST12_31</name>
              <description>PENDRESET</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IPRR2</name>
          <displayName>IPRR2</displayName>
          <description>Interrupt Pending Clear Register</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDRST</name>
              <description>PENDRESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IPRR3</name>
          <displayName>IPRR3</displayName>
          <description>Interrupt Pending Clear Register</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDRST</name>
              <description>PENDRESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>		
		<register>
          <name>IPRR4</name>
          <displayName>IPRR4</displayName>
          <description>Interrupt Pending Clear Register</description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDRST</name>
              <description>PENDRESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>		
		<register>
          <name>IPRR5</name>
          <displayName>IPRR5</displayName>
          <description>Interrupt Pending Clear Register</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDRST</name>
              <description>PENDRESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>		
		<register>
          <name>IACTR1</name>
          <displayName>IACTR1</displayName>
          <description>Interrupt ACTIVE Register</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IACTS2_3</name>
              <description>IACTS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IACTS5</name>
              <description>IACTS</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IACTS8_9</name>
              <description>IACTS</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IACTS12_31</name>
              <description>IACTS</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IACTR2</name>
          <displayName>IACTR2</displayName>
          <description>Interrupt ACTIVE Register</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IACTS</name>
              <description>IACTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>IACTR3</name>
          <displayName>IACTR3</displayName>
          <description>Interrupt ACTIVE Register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IACTS</name>
              <description>IACTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>		
		<register>
          <name>IACTR4</name>
          <displayName>IACTR4</displayName>
          <description>Interrupt ACTIVE Register</description>
          <addressOffset>0x30C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IACTS</name>
              <description>IACTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>		
		<register>
          <name>IACTR5</name>
          <displayName>IACTR5</displayName>
          <description>Interrupt ACTIVE Register</description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IACTS</name>
              <description>IACTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>		
		<register>
		  <dim>256</dim>
		  <dimIncrement>1</dimIncrement>
		  <name>IPRIOR[%s]</name>
		  <description>Interrupt Priority Register</description>
		  <addressOffset>0x400</addressOffset>
		  <size>0x8</size>
		  <access>read-write</access>
		  <resetValue>0x00</resetValue>
		</register>

		<register>
		  <dim>256</dim>
		  <dimIncrement>1</dimIncrement>
		  <name>IALLOCR[%s]</name>
		  <description>Interrupt Allocation Register</description>
		  <addressOffset>0x600</addressOffset>
		  <size>0x8</size>
		  <access>read-write</access>
		  <resetValue>0x00</resetValue>
		</register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>IAUTR[%s]</name>
          <description>Interrupt Authority Register</description>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>WAKEIP0</name>
          <displayName>WAKEIP0</displayName>
          <description>PFIC wake-up instruction pointer register 0</description>
          <addressOffset>0x720</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_RELOAD0</name>
              <description>The PC address register on kernel C0 wake-up, 
			  which is used to reload the PC value after power-on wake-up and reset wake-up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>		
            <field>
              <name>SHUTDOWN0</name>
              <description>Kernel C0 Deep Sleep (Locked) Cancellation Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>		
          </fields>
        </register>
        <register>
          <name>WAKEIP1</name>
          <displayName>WAKEIP1</displayName>
          <description>PFIC wake-up instruction pointer register 1</description>
          <addressOffset>0x724</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_RELOAD1</name>
              <description>The PC address register on kernel C1 wake-up, 
			  which is used to reload the PC value after power-on wake-up and reset wake-up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>		
            <field>
              <name>SHUTDOWN1</name>
              <description>Kernel C1 Deep Sleep (Locked) Cancellation Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>		
          </fields>
        </register>
        <register>
          <name>CSTAR0</name>
          <displayName>CSTAR0</displayName>
          <description>PFIC kernel status register 0</description>
          <addressOffset>0x780</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_nest_sta_0</name>
              <description>The nested status register of kernel C0 interrupts is used to
			  query the nested state of kernel C0 interrupts. nest_sta bits from the INEST_CTLR register of the CSR register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_irq_active_0</name>
              <description>Kernel C0 interrupt active flag register, 
			  which is used to query whether kernel C0 is processing interrupts</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_irq_pend_0</name>
              <description>Kernel C0 interrupt pending flag register, which is used to query kernel C1 for unhandled interrupts</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_globl_ie_0</name>
              <description>The kernel C0 global interrupt enable register is used to 
			  query whether the kernel C0 global interrupt is enabled</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_dbg_mode_0</name>
              <description>Kernel C0 debug mode register, which is used to query whether kernel C0 is in debug mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_lock_up_0</name>
              <description>The kernel C0 lock status register is used to query whether kernel C0 is in the locked state</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_ex_state_0</name>
              <description>The kernel C0 status register is used to obtain the running state of kernel C0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>					
          </fields>
        </register>
        <register>
          <name>CSTAR1</name>
          <displayName>CSTAR1</displayName>
          <description>PFIC kernel status register 1</description>
          <addressOffset>0x784</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_nest_sta_1</name>
              <description>The nested status register of kernel C1 interrupts is used to
			  query the nested state of kernel C1 interrupts. nest_sta bits from the INEST_CTLR register of the CSR register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_irq_active_1</name>
              <description>Kernel C1 interrupt active flag register, 
			  which is used to query whether kernel C1 is processing interrupts</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_irq_pend_1</name>
              <description>Kernel C1 interrupt pending flag register, which is used to query kernel C1 for unhandled interrupts</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_globl_ie_1</name>
              <description>The kernel C1 global interrupt enable register is used to 
			  query whether the kernel C1 global interrupt is enabled</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_dbg_mode_1</name>
              <description>Kernel C1 debug mode register, which is used to query whether kernel C1 is in debug mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_lock_up_1</name>
              <description>The kernel C1 lock status register is used to query whether kernel C1 is in the locked state</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_ex_state_1</name>
              <description>The kernel C1 status register is used to obtain the running state of kernel C1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>					
          </fields>
        </register>		
        <register>
          <name>EENR</name>
          <displayName>EENR</displayName>
          <description>PFIC Event Enable Register</description>
          <addressOffset>0xC80</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>EVENTEN</name>
              <description>31-0 Event wake-up enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>				
          </fields>
        </register>
        <register>
          <name>EPR</name>
          <displayName>EPR</displayName>
          <description>PFIC Event Suspend Register</description>
          <addressOffset>0xC84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT_PEND31_8</name>
              <description>31-8 event is suspended, write 1 to clear zero</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>		
            <field>
              <name>EVENT_PEND7_0</name>
              <description>7-0 Event Pending Status, Not Clearable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>		
          </fields>
        </register>
        <register>
          <name>EWUPR</name>
          <displayName>EWUPR</displayName>
          <description>PFIC Event Wake Register</description>
          <addressOffset>0xC88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT_WUP</name>
              <description>31-0 Event Wake Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>				
          </fields>
        </register>
		<register>
          <name>SCTLR</name>
          <displayName>SCTLR</displayName>
          <description>System Control Register</description>
          <addressOffset>0xD10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLEEPONEXIT</name>
              <description>system leaves the state after an interruption</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			 <field>
              <name>SLEEPDEEP</name>
              <description>low power mode selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			 <field>
              <name>WFITOWFE</name>
              <description>ues WFI as WFE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
		  <field>
              <name>SEVONPEND</name>
              <description>SEVONPEND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>SETEVENT</name>
              <description>set event</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>HART_ID</name>
              <description>Kernel ID register,
			  which is used to obtain the kernel ID of the reader register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
			<field>
              <name>SYSRST</name>
              <description>System reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
		</registers>
	</peripheral>

	</peripherals>
 </device>
